const object = {
    mapIcons: {
        "克拉": [83.61, 45.79, 200], // 坐标点位置 // 必填

        "轮南": [84.81, 40.99, 200], // 坐标点位置 // 必填

        "迪那": [84.81, 42.29, 200], // 坐标点位置 // 必填

        "南疆利民": [76.41, 39.19, 200], // 坐标点位置 // 必填

        "英买": [81.31, 41.99, 200], // 坐标点位置 // 必填

        "塔中": [82.21, 38.89, 200], // 坐标点位置 // 必填

        "油气运销": [87.31, 41.59, 200], // 坐标点位置 // 必填
    },
    title: "新疆分公司2021年项目进度",// 必填
    projectData: [
        {
            "项目年份": 2021,
            "所属项目": "大北试采集气干线清管内检测项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务（克拉油气开发部）合同（810521050074）",
            "所属二级单位": "克拉", // 必填
            "管道编号": "KC-KS-CQD-JS-0101",
            "单项工程名称": "大北试采集气干线清管内检测项目",// 必填
            "系统名称": "大北试采集气干线（克深段）",
            "管道规格": "φ273mm×12.5mm/14.2mm/16mm×70km",
            "系统规格": "",
            "项目进程": "10月25日完成漏磁检测器，数据发回数据分析进行确认。（项目形象进度80%）",
            "目前存在问题": "泡沫球有不同程度损坏，业主停产检修，检修完毕后，与业主沟通下一步作业计划及方案。",
            "实际项目经理": "韩兆军/18131695910",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2021年6月10日-2024年3月31日",
            "合同金额":"总金额：4275000元（单项：945000元）",
            "项目进度": 0.8 // 必填数字类型
            // 还有内容都可以加可以自动显示
        },
        {
            "项目年份": 2021,
            "所属项目": "桑南处理站原油外输管线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "轮南油气开发部2021-2024年集输管道内检测服务合同（880521050068）",
            "所属二级单位": "轮南", // 必填
            "管道编号": "KF-SJ-CYD-JS-0835",
            "单项工程名称": "桑南处理站原油外输管线项目",// 必填
            "系统名称": "",
            "管道规格": "φ273mm×7mm×18.4km",
            "系统规格": "",
            "项目进程": "8月24日完成三轴漏磁检测器，清出油泥杂质5公斤，数据发回数据分析中心确认。（项目形象进度75%）",
            "目前存在问题": "日输量小，管线含水量大，且介质温度较高，且沿线存在4D弯头，开工前需与业主协调输送介质、温度及输量计划。",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"黄旭/13473649518",
            "合同要求工期": "2021年6月11日-2024年3月31日",
            "合同金额":"总金额：3794000元（单项：542000元）",
            "项目进度": 0.90 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "迪北集气管线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "迪那油气开发部迪北集气管道内检测合同（820521060090）",
            "所属二级单位": "迪那", // 必填
            "管道编号": "TR-DN-CQD-JS-0012",
            "单项工程名称": "迪北集气管线项目",// 必填
            "系统名称": "迪北集气干线",
            "管道规格": "φ273mm×10.5mm×18.49km",
            "系统规格": "φ273mm×14.5mm×19km",
            "项目进程": "9月16日完成四碟测径清管器，未清出杂质，测径板轻微变形。（项目形象进度40%）",
            "目前存在问题": "该管线压力14.5MPa，日输量11万方，根据计算，速度为0.2m/s。该管线压力高、输量小，开工前需与业主协调输量及降压问题。",
            "实际项目经理": "张昕/18730693069",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2021年6月29日-2021年12月31日",
            "合同金额":"总金额：585000元",
            "项目进度": 0.4 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "大北至南疆利民3号阀室输气管线(大北输气站-阿克苏末站)项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务（南疆利民油气运行中心）测试检验合同（TXN040521050019）",
            "所属二级单位": "南疆利民", // 必填
            "管道编号": " XN-GD-KSYQ-DBZNJGX-GA1-0037",
            "单项工程名称": "大北至南疆利民3号阀室输气管线(大北输气站-阿克苏末站)项目",// 必填
            "系统名称": "",
            "管道规格": "φ508mm×7.1/7.9/10.3/12.7mm×98.6km",
            "系统规格": "",
            "项目进程": "9月5日完成第五轮次508三轴高清腐蚀检测器，数据发回公司进行分析。（项目形象进度75%）",
            "目前存在问题": "",
            "实际项目经理": "吴南勋/13832688046",
            "合同项目经理":"张永江/13831661921",
            "合同要求工期": "2021年6月7日-2022年10 月31日",
            "合同金额":"总金额：3330000元（单项：1165000元）",
            "项目进度": 0.75 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "阿克苏清管站至三岔清管站输气干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务（南疆利民油气运行中心）测试检验合同（TXN040521050019）",
            "所属二级单位": "南疆利民", // 必填
            "管道编号": "",
            "单项工程名称": "阿克苏清管站至三岔清管站输气干线项目",// 必填
            "系统名称": "",
            "管道规格": "φ559mm×7.1 /7.9/8.7/10.3mm×218.93km",
            "系统规格": "",
            "项目进程": "9月11日完成钢刷测径清管器，测径板轻微变形。（项目形象进度40%）",
            "目前存在问题": "",
            "实际项目经理": "吴南勋/13832688046",
            "合同项目经理":"张永江/13831661921",
            "合同要求工期": "2021年6月7日-2022年10 月31日",
            "合同金额":"总金额：3330000元（单项：2165000元）",
            "项目进度": 0.4 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "YT2集气站至英买处理站集输干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "英买油气开发部管道内检测服务合同（830521050031）",
            "所属二级单位": "英买", // 必填
            "管道编号": "",
            "单项工程名称": "YT2集气站至英买处理站集输干线项目",// 必填
            "系统名称": "",
            "管道规格": "φ355.6mm×20mm×15km",
            "系统规格": "",
            "项目进程": "等待业主调节气量后开始现场作业。（项目形象进度15%）",
            "目前存在问题": "该条管线为厚壁管，需要对设备进行改造;YT2集气站至英买处理站集输干线目前气量不足。",
            "实际项目经理": "韩兆军/18131695910",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2021年6月17日-2024年3月31日",
            "合同金额":"总金额：5045000元（单项：555000元）",
            "项目进度": 0.15 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "YM7集气站至英买处理站集输干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "英买油气开发部管道内检测服务合同（830521050031）",
            "所属二级单位": "英买", // 必填
            "管道编号": "",
            "单项工程名称": "YM7集气站至英买处理站集输干线项目",// 必填
            "系统名称": "",
            "管道规格": "φ323.9mm×17.5mm×24km",
            "系统规格": "",
            "项目进程": "9月16日完成钢刷清管器，计划9月17日继续发钢刷清管器。（项目形象进度35%）",
            "目前存在问题": "该条管线为厚壁管，需要对设备进行改造。",
            "实际项目经理": "韩兆军/18131695910",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2021年6月17日-2024年3月31日",
            "合同金额":"总金额：5045000元（单项：555000元）",
            "项目进度": 0.35 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "塔三联至塔二联外输气管线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务-塔中合同（120521050031）",
            "所属二级单位": "塔中", // 必填
            "管道编号": "",
            "单项工程名称": "塔三联至塔二联外输气管线项目",// 必填
            "系统名称": "塔三联天然气外输管线",
            "管道规格": "φ711mm×8.8/14.2×73km",
            "系统规格": "",
            "项目进程": "人员、设备已到达现场，正在与业主对接方案及开工手续。（项目形象进度15%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"黄旭/13473649518",
            "合同要求工期": "2021年5月31日-2024年3月31日",
            "合同金额":"总金额：9861000元（单项：1035000元）",
            "项目进度": 0.15 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "1#集气站至塔三联中压气管线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务-塔中合同（120521050031）",
            "所属二级单位": "塔中", // 必填
            "管道编号": "",
            "单项工程名称": "1#集气站至塔三联中压气管线项目",// 必填
            "系统名称": "",
            "管道规格": "φ273mm×6.3/8mm×21km",
            "系统规格": "",
            "项目进程": "人员、设备已到达现场，正在与业主对接方案及开工手续。（项目形象进度15%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"黄旭/13473649518",
            "合同要求工期": "2021年5月31日-2024年3月31日",
            "合同金额":"总金额：9861000元（单项：542000元）",
            "项目进度": 0.15 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "塔二联至中间清管站原料气管道项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务-塔中合同（120521050031）",
            "所属二级单位": "塔中", // 必填
            "管道编号": "",
            "单项工程名称": "塔二联至中间清管站原料气管道项目",// 必填
            "系统名称": "",
            "管道规格": "φ323.9mm×10mm×54km",
            "系统规格": "",
            "项目进程": "人员、设备已到达现场，正在与业主对接方案及开工手续。（项目形象进度15%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"黄旭/13473649518",
            "合同要求工期": "2021年5月31日-2024年3月31日",
            "合同金额":"总金额：9861000元（单项：775000元）",
            "项目进度": 0.15 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "轮库原油管道复线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "2021年油气运销部净化油气管道内检测(第二标段）合同（050521030303）",
            "所属二级单位": "油气运销", // 必填
            "管道编号": "XS-KC-GDD-GA-0002",
            "单项工程名称": "轮库原油管道复线项目",// 必填
            "系统名称": "轮库输油管道复线",
            "管道规格": "φ508mm×7mm/8mm×161.5km",
            "系统规格": "φ508mm×7mm/8mm×151.525km",
            "项目进程": "现场作业已完工。（项目形象进度85%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"曹雷/13722644119",
            "合同要求工期": "自甲方开工报告起始日起至工期120天止",
            "合同金额":"总金额：2840000元",
            "项目进度": 0.85 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "东轮输油管道项目",
            "业主单位": "中石油", // 必填
            "所属合同": "2021年油气运销部净化油气管道内检测(第二标段）合同（050521030303）",
            "所属二级单位": "油气运销", // 必填
            "管道编号": "XS-GD-000-GA-0492",
            "单项工程名称": "东轮输油管道项目",// 必填
            "系统名称": "",
            "管道规格": "φ323.9×6mm×17km",
            "系统规格": "φ323.9×6mm×15km",
            "项目进程": "10月29日完成三轴漏磁腐蚀检测器，清出杂质(蜡)约200kg，数据发回公司进行详细分析。（项目形象进度80%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"曹雷/13722644119",
            "合同要求工期": "自甲方开工报告起始日起至工期120天止",
            "合同金额":"总金额：2840000元",
            "项目进度": 0.8 // 必填数字类型
        },
        {
            "项目年份": 2021,
            "所属项目": "克深输气管道项目",
            "业主单位": "中石油", // 必填
            "所属合同": "2021年油气运销部净化油气管道内检测(第二标段）合同（050521030303）",
            "所属二级单位": "油气运销", // 必填
            "管道编号": "XS-GD-000-GA-0508",
            "单项工程名称": "克深输气管道项目",// 必填
            "系统名称": "",
            "管道规格": "φ1016×14.2mm×25km",
            "系统规格": "φ1016×14.2mm×25.021km",
            "项目进程": "9月3日完成三轴变形漏磁复合检测器，数据发回公司进行详细分析。（项目形象进度75%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"曹雷/13722644119",
            "合同要求工期": "自甲方开工报告起始日起至工期120天止",
            "合同金额":"总金额：2840000元",
            "项目进度": 0.75 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "塔轮输油管道（前半段）项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测（中油管道））服务项目（油气运销部）[050521050310]",
            "所属二级单位": "油气运销", // 必填
            "管道编号": "XS-GD-000-GA-0272",
            "单项工程名称": "塔轮输油管道（前半段）项目",// 必填
            "系统名称": "",
            "管道规格": "Ф426×7/8/9",
            "系统规格": "",
            "项目进程": "管线改造，暂停作业（项目形象进度0%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：1256.5万元（单条124.5万元）",
            "项目进度": 0.0 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "塔轮凝析油管道（后半段）项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测（中油管道））服务项目（油气运销部）[050521050310]",
            "所属二级单位": "油气运销", // 必填
            "管道编号": "XS-GD-000-GA-0531",
            "单项工程名称": "塔轮凝析油管道（后半段）项目",// 必填
            "系统名称": "",
            "管道规格": "Ф426×7/8/9",
            "系统规格": "",
            "项目进程": "管线改造，暂停作业（项目形象进度0%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：1256.5万元（单条124.5万元）",
            "项目进度": 0.0 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "轮库输气管道项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测（中油管道））服务项目（油气运销部）[050521050310]",
            "所属二级单位": "油气运销", // 必填
            "管道编号": "XS-KC-GDD-GA-0001",
            "单项工程名称": "轮库输气管道项目",// 必填
            "系统名称": "",
            "管道规格": "Ф610×7/8",
            "系统规格": "",
            "项目进程": "管线改造，暂停作业，完成现场踏勘（项目形象进度10%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：1256.5万元（单条124.5万元）",
            "项目进度": 0.1 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "哈轮输油管道项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测（中油管道））服务项目（油气运销部）[050521050310]",
            "所属二级单位": "油气运销", // 必填
            "管道编号": "XS-GD-000-GA-0511",
            "单项工程名称": "哈轮输油管道项目",// 必填
            "系统名称": "",
            "管道规格": "Ф355.6×6.3",
            "系统规格": "",
            "项目进程": "管线改造，暂停作业，完成现场踏勘（项目形象进度10%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：1256.5万元（单条124.5万元）",
            "项目进度": 0.1 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "YM17集气站至YM7集气站集输干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "英买油气开发部管道内检测服务合同[830521050031]",
            "所属二级单位": "英买", // 必填
            "管道编号": "TR-YM-CQD-JS-3024",
            "单项工程名称": "YM17集气站至YM7集气站集输干线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ219.1×12.5",
            "系统规格": "",
            "项目进程": "完成方案对接，等待设备调遣（项目形象进度10%）",
            "目前存在问题": "因疫情原因设备调遣不便",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：504.5万元（单条55.5万元）",
            "项目进度": 0.1 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "YM7集气站至英买处理站集输干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "英买油气开发部管道内检测服务合同[830521050031]",
            "所属二级单位": "英买", // 必填
            "管道编号": "TR-YM-CQD-JS-3589",
            "单项工程名称": "YM7集气站至英买处理站集输干线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ323.9×17.5",
            "系统规格": "",
            "项目进程": "完成方案对接，等待设备调遣（项目形象进度10%）",
            "目前存在问题": "因疫情原因设备调遣不便",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：504.5万元（单条55.5万元）",
            "项目进度": 0.1 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "YT5集气站到YT1集气站集输干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "英买油气开发部管道内检测服务合同[830521050031]",
            "所属二级单位": "英买", // 必填
            "管道编号": "TR-YM-CQD-JS-2990",
            "单项工程名称": "YT5集气站到YT1集气站集输干线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ273×16",
            "系统规格": "",
            "项目进程": "完成方案对接，等待设备调遣（项目形象进度10%）",
            "目前存在问题": "因疫情原因设备调遣不便",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：504.5万元（单条55.5万元）",
            "项目进度": 0.1 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "YD2集气站到YT5集气站集输干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "英买油气开发部管道内检测服务合同[830521050031]",
            "所属二级单位": "英买", // 必填
            "管道编号": "TR-YM-CQD-JS-2991",
            "单项工程名称": "YD2集气站到YT5集气站集输干线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ219.1×12.5",
            "系统规格": "",
            "项目进程": "完成方案对接，等待设备调遣（项目形象进度10%）",
            "目前存在问题": "因疫情原因设备调遣不便",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：504.5万元（单条55.5万元）",
            "项目进度": 0.1 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "YT1集气站至YT2集气站集输干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "英买油气开发部管道内检测服务合同[830521050031]",
            "所属二级单位": "英买", // 必填
            "管道编号": "TR-YM-CQD-JS-2995",
            "单项工程名称": "YT1集气站至YT2集气站集输干线项目",// 必填
            "系统名称": "",
            "管道规格": "",
            "系统规格": "",
            "项目进程": "完成方案对接，等待设备调遣（项目形象进度10%）",
            "目前存在问题": "因疫情原因设备调遣不便",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：504.5万元（单条55.5万元）",
            "项目进度": 0.1 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "YT2集气站至英买处理站集输干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "英买油气开发部管道内检测服务合同[830521050031]",
            "所属二级单位": "英买", // 必填
            "管道编号": "",
            "单项工程名称": "YT2集气站至英买处理站集输干线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ355.6×20",
            "系统规格": "",
            "项目进程": "完成方案对接，等待设备调遣（项目形象进度10%）",
            "目前存在问题": "因疫情原因设备调遣不便",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：504.5万元（单条55.5万元）",
            "项目进度": 0.1 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "2#集气站低压集输管线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "轮南油气开发部2021-2024年集输管道内检测服务[880521050068]",
            "所属二级单位": "轮南", // 必填
            "管道编号": "KF-SJ-CYD-JS-1060",
            "单项工程名称": "2#集气站低压集输管线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ219×6.6",
            "系统规格": "",
            "项目进程": "3月15日完成第一次清管，清出油泥约2KG，测径板轻微变形（项目形象进度15%）",
            "目前存在问题": "",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：379.4万元（单条：54.2万元）",
            "项目进度": 0.15 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "2#集气站高压集输管线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "轮南油气开发部2021-2024年集输管道内检测服务合同[880521050068]",
            "所属二级单位": "轮南", // 必填
            "管道编号": "KF-SJ-CYD-JS-0839",
            "单项工程名称": "2#集气站高压集输管线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ219×14",
            "系统规格": "",
            "项目进程": "正在进行现场踏勘（项目形象进度5%）",
            "目前存在问题": "",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：379.4万元（单条：54.2万元）",
            "项目进度": 0.05 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "LG35井至LN631-1井集输管线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "轮南油气开发部2021-2024年集输管道内检测服务合同[880521050068]",
            "所属二级单位": "轮南", // 必填
            "管道编号": "KF-SJ-CYD-JS-0099",
            "单项工程名称": "LG35井至LN631-1井集输管线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ168×10",
            "系统规格": "",
            "项目进程": "正在进行现场踏勘（项目形象进度5%）",
            "目前存在问题": "",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：379.4万元（单条：54.2万元）",
            "项目进度": 0.05 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "阿克苏清管站至三岔清管站输气干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务（南疆利民油气运行中心）测试检验合同（2021年）[TXN040521050019]",
            "所属二级单位": "南疆利民", // 必填
            "管道编号": "XN-GD-KSYQ-YKGX-GA1-0001",
            "单项工程名称": "阿克苏清管站至三岔清管站输气干线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ559×7.1/7.9/8.7/10.3",
            "系统规格": "",
            "项目进程": "2021年完成2次清管后因气量不足暂停作业（项目形象进度25%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2022年10月31日",
            "合同金额":"总金额：333万元（单条：216.5万元）",
            "项目进度": 0.25 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "和泽干线(和田输气站-泽普输气站)项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务(南疆利民油气运行中心)测试检验合同（2022年）",
            "所属二级单位": "南疆利民", // 必填
            "管道编号": "XN-YX-HJC-GC-001",
            "单项工程名称": "和泽干线(和田输气站-泽普输气站)项目",// 必填
            "系统名称": "",
            "管道规格": "Φ508×7.1/7.9/8.7/9.5",
            "系统规格": "",
            "项目进程": "完成现场踏勘（项目形象进度5%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"/",
            "合同要求工期": "2023年4月30日",
            "合同金额":"总金额：543万元（单条：312.5万元）",
            "项目进度": 0.05 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "塔二联至中间清管站原料气管道项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务合同-塔中[120521050031]",
            "所属二级单位": "塔中", // 必填
            "管道编号": "TZ-C2-000-JS-0022",
            "单项工程名称": "塔二联至中间清管站原料气管道项目",// 必填
            "系统名称": "",
            "管道规格": "Φ323.9×10",
            "系统规格": "",
            "项目进程": "完成方案对接与开工手续办理（项目形象进度5%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：986.1万元（单条：77.5万元）",
            "项目进度": 0.05 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "塔三联至塔二联外输气管线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务合同-塔中[120521050031]",
            "所属二级单位": "塔中", // 必填
            "管道编号": "TZ-C2-000-JS-0022",
            "单项工程名称": "塔三联至塔二联外输气管线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ711×8.8/14.2",
            "系统规格": "",
            "项目进程": "完成方案对接与开工手续办理（项目形象进度5%）",
            "目前存在问题": "",
            "实际项目经理": "黄旭/13473649518",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：986.1万元（单条：103.5万元）",
            "项目进度": 0.05 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "克深242至大北试采干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务合同（克拉油气开发部）[810521050074]",
            "所属二级单位": "克拉", // 必填
            "管道编号": "KC-KS-CQD-JS-0105",
            "单项工程名称": "克深242至大北试采干线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ273×12.5",
            "系统规格": "",
            "项目进程": "正在进行前期审查（项目形象进度3%）",
            "目前存在问题": "",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：427.5万元（单条：55.5万元）",
            "项目进度": 0.05 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "克深133试采干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务合同（克拉油气开发部）[810521050074]",
            "所属二级单位": "克拉", // 必填
            "管道编号": "KC-KeS-CQD-JS-0301",
            "单项工程名称": "克深133试采干线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ219.1×11",
            "系统规格": "",
            "项目进程": "正在进行前期审查（项目形象进度3%）",
            "目前存在问题": "",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：427.5万元（单条：55.5万元）",
            "项目进度": 0.05 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "新建克深2集气干线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "塔里木油田管道内检测服务合同（克拉油气开发部）[810521050074]",
            "所属二级单位": "克拉", // 必填
            "管道编号": "KC-KeS-CQD-JS-0264",
            "单项工程名称": "新建克深2集气干线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ219.1×7.1",
            "系统规格": "",
            "项目进程": "正在进行前期审查（项目形象进度3%）",
            "目前存在问题": "",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2024年3月31日",
            "合同金额":"总金额：427.5万元（单条：55.5万元）",
            "项目进度": 0.05 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "YH7低压集气站至牙哈处理站项目",
            "业主单位": "中石油", // 必填
            "所属合同": "迪那油气开发部YH7集气管道内检测[820522030017]",
            "所属二级单位": "迪那", // 必填
            "管道编号": "TR-YH-CQD-JS-1594",
            "单项工程名称": "YH7低压集气站至牙哈处理站项目",// 必填
            "系统名称": "",
            "管道规格": "Φ219×13.5",
            "系统规格": "",
            "项目进程": "暂未开工（项目形象进度0%）",
            "目前存在问题": "",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"/",
            "合同要求工期": "2022年12月31日",
            "合同金额":"总金额：60万元",
            "项目进度": 0.0 // 必填数字类型
        },
        {
            "项目年份": 2022,
            "所属项目": "迪北集气管线项目",
            "业主单位": "中石油", // 必填
            "所属合同": "迪那油气开发部迪北集气管道内检测项目[820521060090]",
            "所属二级单位": "迪那", // 必填
            "管道编号": "",
            "单项工程名称": "迪北集气管线项目",// 必填
            "系统名称": "",
            "管道规格": "Φ273×10.5",
            "系统规格": "",
            "项目进程": "2021年完成一次清管作业，后因气量不足暂停后续工作（项目形象进度15%）",
            "目前存在问题": "",
            "实际项目经理": "刘沫/19999445819",
            "合同项目经理":"刘沫/19999445819",
            "合同要求工期": "2021年12月31日",
            "合同金额":"总金额：58.5万元",
            "项目进度": 0.15 // 必填数字类型
        }
    ],
    login: {
        name: "管理员",// 用户名
        password: "adminXJ"// 密码
    }
}

export default object